app/controllers/chatroom_controller.rb

    def index
        @message = Message.new
        @messages = Message.all
---
SELECT "messages".* FROM "messages"