app/controllers/messages_controller.rb

    def create
        message = current_user.messages.build(message_params)
        if message.save
---
INSERT INTO "messages" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["body", "faf"], ["user_id", 1], ["created_at", "2024-01-04 18:12:42.548923"], ["updated_at", "2024-01-04 18:12:42.548923"]]